# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.11-s014_1 on Mon Jun 20 12:59:59 EEST 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design Core

create_clock -name "sys_clk1" -add -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load -max 10.0 [get_ports {next_pc[31]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[30]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[29]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[28]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[27]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[26]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[25]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[24]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[23]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[22]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[21]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[20]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[19]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[18]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[17]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[16]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[15]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[14]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[13]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[12]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[11]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[10]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[9]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[8]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[7]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[6]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[5]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[4]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[3]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[2]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[1]}]
set_load -pin_load -max 10.0 [get_ports {next_pc[0]}]
set_load -pin_load -max 10.0 [get_ports {write_data[31]}]
set_load -pin_load -max 10.0 [get_ports {write_data[30]}]
set_load -pin_load -max 10.0 [get_ports {write_data[29]}]
set_load -pin_load -max 10.0 [get_ports {write_data[28]}]
set_load -pin_load -max 10.0 [get_ports {write_data[27]}]
set_load -pin_load -max 10.0 [get_ports {write_data[26]}]
set_load -pin_load -max 10.0 [get_ports {write_data[25]}]
set_load -pin_load -max 10.0 [get_ports {write_data[24]}]
set_load -pin_load -max 10.0 [get_ports {write_data[23]}]
set_load -pin_load -max 10.0 [get_ports {write_data[22]}]
set_load -pin_load -max 10.0 [get_ports {write_data[21]}]
set_load -pin_load -max 10.0 [get_ports {write_data[20]}]
set_load -pin_load -max 10.0 [get_ports {write_data[19]}]
set_load -pin_load -max 10.0 [get_ports {write_data[18]}]
set_load -pin_load -max 10.0 [get_ports {write_data[17]}]
set_load -pin_load -max 10.0 [get_ports {write_data[16]}]
set_load -pin_load -max 10.0 [get_ports {write_data[15]}]
set_load -pin_load -max 10.0 [get_ports {write_data[14]}]
set_load -pin_load -max 10.0 [get_ports {write_data[13]}]
set_load -pin_load -max 10.0 [get_ports {write_data[12]}]
set_load -pin_load -max 10.0 [get_ports {write_data[11]}]
set_load -pin_load -max 10.0 [get_ports {write_data[10]}]
set_load -pin_load -max 10.0 [get_ports {write_data[9]}]
set_load -pin_load -max 10.0 [get_ports {write_data[8]}]
set_load -pin_load -max 10.0 [get_ports {write_data[7]}]
set_load -pin_load -max 10.0 [get_ports {write_data[6]}]
set_load -pin_load -max 10.0 [get_ports {write_data[5]}]
set_load -pin_load -max 10.0 [get_ports {write_data[4]}]
set_load -pin_load -max 10.0 [get_ports {write_data[3]}]
set_load -pin_load -max 10.0 [get_ports {write_data[2]}]
set_load -pin_load -max 10.0 [get_ports {write_data[1]}]
set_load -pin_load -max 10.0 [get_ports {write_data[0]}]
set_load -pin_load -max 10.0 [get_ports {address_data[31]}]
set_load -pin_load -max 10.0 [get_ports {address_data[30]}]
set_load -pin_load -max 10.0 [get_ports {address_data[29]}]
set_load -pin_load -max 10.0 [get_ports {address_data[28]}]
set_load -pin_load -max 10.0 [get_ports {address_data[27]}]
set_load -pin_load -max 10.0 [get_ports {address_data[26]}]
set_load -pin_load -max 10.0 [get_ports {address_data[25]}]
set_load -pin_load -max 10.0 [get_ports {address_data[24]}]
set_load -pin_load -max 10.0 [get_ports {address_data[23]}]
set_load -pin_load -max 10.0 [get_ports {address_data[22]}]
set_load -pin_load -max 10.0 [get_ports {address_data[21]}]
set_load -pin_load -max 10.0 [get_ports {address_data[20]}]
set_load -pin_load -max 10.0 [get_ports {address_data[19]}]
set_load -pin_load -max 10.0 [get_ports {address_data[18]}]
set_load -pin_load -max 10.0 [get_ports {address_data[17]}]
set_load -pin_load -max 10.0 [get_ports {address_data[16]}]
set_load -pin_load -max 10.0 [get_ports {address_data[15]}]
set_load -pin_load -max 10.0 [get_ports {address_data[14]}]
set_load -pin_load -max 10.0 [get_ports {address_data[13]}]
set_load -pin_load -max 10.0 [get_ports {address_data[12]}]
set_load -pin_load -max 10.0 [get_ports {address_data[11]}]
set_load -pin_load -max 10.0 [get_ports {address_data[10]}]
set_load -pin_load -max 10.0 [get_ports {address_data[9]}]
set_load -pin_load -max 10.0 [get_ports {address_data[8]}]
set_load -pin_load -max 10.0 [get_ports {address_data[7]}]
set_load -pin_load -max 10.0 [get_ports {address_data[6]}]
set_load -pin_load -max 10.0 [get_ports {address_data[5]}]
set_load -pin_load -max 10.0 [get_ports {address_data[4]}]
set_load -pin_load -max 10.0 [get_ports {address_data[3]}]
set_load -pin_load -max 10.0 [get_ports {address_data[2]}]
set_load -pin_load -max 10.0 [get_ports {address_data[1]}]
set_load -pin_load -max 10.0 [get_ports {address_data[0]}]
set_load -pin_load -max 10.0 [get_ports write_mem_data]
set_load -pin_load -max 10.0 [get_ports read_mem_data]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports clk]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports rst]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[31]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[30]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[29]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[28]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[27]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[26]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[25]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[24]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[23]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[22]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[21]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[20]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[19]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[18]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[17]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[16]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[15]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[14]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[13]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[12]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[11]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[10]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[9]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[8]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[7]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[6]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[5]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[4]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[3]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[2]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[1]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {instruction[0]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[31]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[30]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[29]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[28]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[27]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[26]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[25]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[24]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[23]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[22]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[21]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[20]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[19]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[18]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[17]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[16]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[15]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[14]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[13]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[12]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[11]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[10]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[9]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[8]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[7]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[6]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[5]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[4]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[3]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[2]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[1]}]
set_input_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {read_data[0]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[31]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[30]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[29]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[28]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[27]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[26]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[25]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[24]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[23]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[22]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[21]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[20]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[19]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[18]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[17]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[16]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[15]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[14]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[13]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[12]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[11]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[10]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[9]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[8]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[7]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[6]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[5]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[4]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[3]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[2]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[1]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {next_pc[0]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[31]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[30]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[29]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[28]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[27]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[26]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[25]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[24]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[23]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[22]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[21]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[20]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[19]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[18]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[17]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[16]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[15]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[14]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[13]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[12]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[11]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[10]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[9]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[8]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[7]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[6]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[5]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[4]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[3]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[2]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[1]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {write_data[0]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[31]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[30]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[29]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[28]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[27]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[26]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[25]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[24]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[23]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[22]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[21]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[20]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[19]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[18]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[17]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[16]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[15]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[14]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[13]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[12]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[11]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[10]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[9]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[8]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[7]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[6]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[5]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[4]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[3]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[2]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[1]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports {address_data[0]}]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports write_mem_data]
set_output_delay -clock [get_clocks sys_clk1] -add_delay 0.01 [get_ports read_mem_data]
set_operating_conditions typ_3_30V_25C
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports clk]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports rst]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[31]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[30]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[29]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[28]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[27]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[26]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[25]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[24]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[23]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[22]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[21]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[20]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[19]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[18]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[17]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[16]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[15]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[14]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[13]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[12]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[11]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[10]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[9]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[8]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[7]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[6]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[5]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[4]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[3]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[2]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[1]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {instruction[0]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[31]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[30]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[29]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[28]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[27]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[26]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[25]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[24]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[23]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[22]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[21]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[20]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[19]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[18]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[17]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[16]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[15]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[14]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[13]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[12]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[11]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[10]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[9]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[8]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[7]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[6]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[5]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[4]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[3]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[2]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[1]}]
set_driving_cell -lib_cell BU_3VX1 -library D_CELLS_3V_LPMOS_typ_3_30V_25C -pin "Q" [get_ports {read_data[0]}]
set_wire_load_mode "segmented"
set_wire_load_selection_group "4_metls_routing" -library "D_CELLS_3V_LPMOS_typ_3_30V_25C"
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCN_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCN_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCN_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCP_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCP_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LGCP_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCN_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCN_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCN_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCP_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCP_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSGCP_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCN_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCN_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCN_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCP_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCP_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/LSOGCP_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/STE_3VX1]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/STE_3VX2]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/STE_3VX3]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/STE_3VX4]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/SIGNALHOLD_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/MPROBEBU_3VX8]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/MPROBE_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED10_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED15_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED1_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED25_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED2_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED3_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FEED7_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/DECAP10_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/DECAP15_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/DECAP25_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/DECAP5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/DECAP7_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE10_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE11_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE12_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE13_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE14_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE15_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE16_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE17_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE18_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE19_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE20_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE21_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE22_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE23_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE24_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE25_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE26_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE27_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE28_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE29_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE2_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE30_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE31_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE32_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE3_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE4_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE6_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE7_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE8_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNE9_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED10_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED11_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED12_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED13_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED14_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED15_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED16_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED17_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED18_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED19_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED20_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED21_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED22_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED23_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED24_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED25_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED26_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED27_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED28_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED29_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED30_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED31_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED32_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED6_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED7_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED8_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/FCNED9_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/ANTENNACELLN2_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/ANTENNACELLN5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/ANTENNACELLNP2_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/ANTENNACELLP2_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/ANTENNACELLP5_3V]
set_dont_use [get_lib_cells D_CELLS_3V_LPMOS_typ_3_30V_25C/CLKVBUF_3V]
